In [1]:
from sqlalchemy import create_engine
import sqlite3 as sql
import pandas as pd

In [53]:
import sqlite3 as sql
connection = sql.connect('sqlite_db_pythonsqlite_2.db')
cur = connection.cursor()

In [70]:
# Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members! 

query = '''WITH fac_per_user AS(
    SELECT f.name,
    CASE WHEN b.memid =0
        THEN b.slots * f.guestcost
        ELSE b.slots * f.membercost
        END AS revenue
    FROM `Bookings` AS b
    LEFT JOIN `Facilities` AS f 
        ON b.facid = f.facid
    LEFT JOIN `Members` AS m 
        ON b.memid = m.memid
)
SELECT name AS Facility_Name, revenue_per_fac AS Total_Revenue
FROM ( SELECT name, SUM(revenue) AS revenue_per_fac
FROM fac_per_user
GROUP BY name)
WHERE revenue_per_fac < 1000
ORDER BY revenue_per_fac;'''

In [73]:
rs = cur.execute(query) # Where Orders is a name of a table, * selects all columns
df = pd.DataFrame(rs.fetchall()) # all rows
df.head()

               0    1
0   Table Tennis  180
1  Snooker Table  240
2     Pool Table  270

In [78]:
# Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order
query = '''SELECT m.firstname ||' '||m.surname AS member, r.firstname||' '||r.surname AS recommended_by
FROM `Members` AS m
LEFT JOIN `Members` AS r
   ON m.recommendedby = r.memid
ORDER BY m.surname, m.firstname;'''

In [79]:
rs = cur.execute(query) # Where Orders is a name of a table, * selects all columns
df = pd.DataFrame(rs.fetchall()) # all rows
df.head()

                0                1
0  Florence Bader  Ponder Stibbons
1      Anne Baker  Ponder Stibbons
2   Timothy Baker   Jemima Farrell
3      Tim Boothe       Tim Rownam
4  Gerald Butters     Darren Smith

In [82]:
# Q12: Find the facilities with their usage by member, but not guests
query = '''SELECT f.name AS facility, SUM(b.slots) AS usage
    FROM `Bookings` AS b
    LEFT JOIN `Facilities` AS f
    ON b.facid = f.facid
    WHERE b.memid != 0
    GROUP BY b.facid; '''

In [83]:
rs = cur.execute(query) # Where Orders is a name of a table, * selects all columns
df = pd.DataFrame(rs.fetchall()) # all rows
df.head()

                 0     1
0   Tennis Court 1   957
1   Tennis Court 2   882
2  Badminton Court  1086
3     Table Tennis   794
4   Massage Room 1   884

In [88]:
# Q13: Find the facilities usage by month, but not guests
query = '''SELECT f.name AS facility, strftime('%m', b.starttime) AS month, SUM(b.slots) AS usage
    FROM `Bookings` AS b
    LEFT JOIN `Facilities` AS f
    ON b.facid = f.facid
    WHERE b.memid != 0
    GROUP BY b.facid,strftime('%m', b.starttime); '''

In [89]:
rs = cur.execute(query) # Where Orders is a name of a table, * selects all columns
df = pd.DataFrame(rs.fetchall()) # all rows
df.head()

                0   1    2
0  Tennis Court 1  07  201
1  Tennis Court 1  08  339
2  Tennis Court 1  09  417
3  Tennis Court 2  07  123
4  Tennis Court 2  08  345